Revit 2027 API
IndexLine Class
 A line segment primitive consisting of two indices.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.IndexPrimitive
 Autodesk.Revit.DB.DirectContext3D.IndexLine
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IndexLine : IndexPrimitive
Public Class IndexLine
	Inherits IndexPrimitive
public ref class IndexLine : public IndexPrimitive
type IndexLine =
    class
        inherit IndexPrimitive
    end
The IndexLine type exposes the following members.
Constructors
Name | Description
IndexLine |  Constructs the line segment primitive.
Top
Properties
Name | Description
Index0 |  The index of the line segment's first vertex.
Index1 |  The index of the line segment's second vertex.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from IndexPrimitive)
Top
Methods
Name | Description
Dispose
(Inherited from IndexPrimitive)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSizeInShortInts |  Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace